# Exercise 2: Where clause
[โจทย์หน้า: 50](https://luckkrit.github.io/cos3103/slides/2_68/sql_dml)

## Load data

In [1]:
%load_ext sql
# Show more rows in results
%config SqlMagic.displaylimit = 300

In [2]:
%sql postgresql://postgres:12345678@localhost:5432/postgres

Connecting to 'postgresql://postgres:***@localhost:5432/postgres'

In [3]:
%sql SELECT version()

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

1 rows affected.

+-------------------------------------------------------------------------+
|                                 version                                 |
+-------------------------------------------------------------------------+
| PostgreSQL 18.1 on x86_64-windows, compiled by msvc-19.44.35221, 64-bit |
+-------------------------------------------------------------------------+

In [4]:
%sql SET search_path TO classicmodels, public

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

++
||
++
++

## Query

### 1. หาทุก Product ที่มี ```buyPrice``` มากกว่า 50

In [6]:
%%sql
SELECT productCode, productName, buyPrice
FROM products 
WHERE buyPrice > 50
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+-------------+--------------------------------------+----------+
| productcode |             productname              | buyprice |
+-------------+--------------------------------------+----------+
|   S10_1949  |       1952 Alpine Renault 1300       |  98.58   |
|   S10_2016  |        1996 Moto Guzzi 1100i         |  68.99   |
|   S10_4698  | 2003 Harley-Davidson Eagle Drag Bike |  91.02   |
|   S10_4757  |         1972 Alfa Romeo GTA          |  85.68   |
|   S10_4962  |        1962 LanciaA Delta 16V        |  103.42  |
+-------------+--------------------------------------+----------+

### 2. หาทุก order ที่สั่งเข้ามาระหว่างวันที่ 1/1/2004 - 31/12/2004

In [8]:
%%sql
SELECT orderNumber, orderDate, customerNumber
FROM orders
WHERE orderDate between '2004-01-01' and '2004-12-31'
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+-------------+---------------------+----------------+
| ordernumber |      orderdate      | customernumber |
+-------------+---------------------+----------------+
|    10208    | 2004-01-02 00:00:00 |      146       |
|    10209    | 2004-01-09 00:00:00 |      347       |
|    10210    | 2004-01-12 00:00:00 |      177       |
|    10211    | 2004-01-15 00:00:00 |      406       |
|    10212    | 2004-01-16 00:00:00 |      141       |
+-------------+---------------------+----------------+

### 3. หาลูกค้าทุกคนที่อยู่ใน USA, France หรือ Germany

In [9]:
%%sql
SELECT customerNumber, customerName, country
FROM customers
WHERE country in ('USA', 'France', 'Germany')
LIMIT 5;

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

5 rows affected.

+----------------+------------------------------+---------+
| customernumber |         customername         | country |
+----------------+------------------------------+---------+
|      103       |      Atelier graphique       |  France |
|      112       |      Signal Gift Stores      |   USA   |
|      119       |      La Rochelle Gifts       |  France |
|      124       | Mini Gifts Distributors Ltd. |   USA   |
|      128       |     Blauer See Auto, Co.     | Germany |
+----------------+------------------------------+---------+

### 4. ค้นหา employee ทั้งหมดที่มีคำว่า ```Sales``` อยู่ในชื่อตำแหน่งงาน และ ```office code``` เป็น 1 ไม่ก็ 2

In [18]:
%%sql
SELECT employeeNumber, firstName, lastName, jobTitle, officeCode
FROM employees
WHERE jobTitle LIKE '%Sales%' and officeCode in ('1', '2')

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

6 rows affected.

+----------------+-----------+-----------+--------------------+------------+
| employeenumber | firstname |  lastname |      jobtitle      | officecode |
+----------------+-----------+-----------+--------------------+------------+
|      1056      |    Mary   | Patterson |      VP Sales      |     1      |
|      1143      |  Anthony  |    Bow    | Sales Manager (NA) |     1      |
|      1165      |   Leslie  |  Jennings |     Sales Rep      |     1      |
|      1166      |   Leslie  |  Thompson |     Sales Rep      |     1      |
|      1188      |   Julie   |  Firrelli |     Sales Rep      |     2      |
|      1216      |   Steve   | Patterson |     Sales Rep      |     2      |
+----------------+-----------+-----------+--------------------+------------+

### 5. หาทุก Product ทั้งหมดจาก productLine ```Classic Cars``` ที่มีจำนวนสินค้าในสต็อกน้อยกว่า 1000 ชิ้น หรือ ราคาซื้อมากกว่า 75

In [20]:
%%sql
SELECT productCode, productName, productLine, quantityInStock, buyPrice
FROM products
WHERE productLine in ('Classic Cars') and (quantityInStock < 1000 or buyPrice > 75)

Running query in 'postgresql://postgres:***@localhost:5432/postgres'

14 rows affected.

+-------------+--------------------------------+--------------+-----------------+----------+
| productcode |          productname           | productline  | quantityinstock | buyprice |
+-------------+--------------------------------+--------------+-----------------+----------+
|   S10_1949  |    1952 Alpine Renault 1300    | Classic Cars |       7305      |  98.58   |
|   S10_4757  |      1972 Alfa Romeo GTA       | Classic Cars |       3252      |  85.68   |
|   S10_4962  |     1962 LanciaA Delta 16V     | Classic Cars |       6791      |  103.42  |
|   S12_1099  |       1968 Ford Mustang        | Classic Cars |        68       |  95.34   |
|   S12_1108  |       2001 Ferrari Enzo        | Classic Cars |       3619      |  95.59   |
|   S12_3148  |       1969 Corvair Monza       | Classic Cars |       6906      |  89.14   |
|   S12_3380  |       1968 Dodge Charger       | Classic Cars |       9123      |  75.16   |
|   S12_3891  |        1969 Ford Falcon        | Classic Cars |       1049      |  83.05   |
|   S18_1129  |        1993 Mazda RX-7         | Classic Cars |       3975      |  83.51   |
|   S18_1984  |        1995 Honda Civic        | Classic Cars |       9772      |  93.89   |
|   S18_2238  | 1998 Chrysler Plymouth Prowler | Classic Cars |       4724      |  101.51  |
|   S18_3232  |  1992 Ferrari 360 Spider red   | Classic Cars |       8347      |   77.9   |
|   S18_4027  |     1970 Triumph Spitfire      | Classic Cars |       5545      |  91.92   |
|   S24_3856  |    1956 Porsche 356A Coupe     | Classic Cars |       6600      |   98.3   |
+-------------+--------------------------------+--------------+-----------------+----------+